Revit 2027 API
IDirectContext3DServer.GetApplicationId Method
 Reports this server's application ID.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
string GetApplicationId()
Function GetApplicationId As String
String^ GetApplicationId()
abstract GetApplicationId : unit -> string
Return Value
String
 The application ID.
See Also
Reference
IDirectContext3DServer Interface
Autodesk.Revit.DB.DirectContext3D Namespace